from string import Template
from stores.llm.templates.locales.PromptTemplate import PromptTemplate
from stores.llm.templates.response_models.list_wrapper import ListOf

inspiration_prompt = PromptTemplate(
    system=Template('\n'.join([
        "التعليمات:",
        "أنت خبير في تصميم المحتوى والمناهج التعليمية.",
        "سيتم تزويدك بنص نحتاج لاستخدامه كمصدر إلهام لمحتوى تعليمي.",
        "استخرج وأنشئ بشكل إبداعي قائمة بـ 'المواقف السياقية' الفريدة و المميزة (بدون تكرار)  بناءً على الموضوعات أو الأحداث أو الأفعال أو البيئات الموجودة في النص.",
        "",
        "القواعد:",
        "- لا تلخص النص، بل حدد واستخرج سيناريوهات أو بيئات أو أنشطة ديناميكية (مثل: 'انتظار الحافلة في عاصفة'، 'يوم مزدحم في مكتب شركة'، 'اختيار ملابس لحفلة صيفية').",
        "- ستُستخدم هذه السيناريوهات لاحقاً كسياقات خلفية لتضمين أسئلة خاصة بمجال معين.",
        "- لا ترقم المخرجات.",
        "- استخرج أكبر عدد ممكن من المواقف السياقية الفريدة بقدر ما يمكن للنص استيعابه."
    ])),
    user=Template("النص:\n$text"),
    response_model=ListOf[str]
)